**You'll be given a csv dataset file and you'll be extracting data from it through pandas or pyspark. Then there will be the transformation phase and after performing that you'll try to load the final data to a database.**

**There are some problems with the data and you need to remove them during the transformation phase to make data useful for everyone:**
- An order id should always exist as an integer
- A product id cannot be 0
- We never had a product priced more than 1500 Rs. so any item with amount greater than 1500 Rs is an anomaly and it should be treated as 1500 Rs 
- A status of an item can never be null or None, if it is then its an anomaly and item rows to be considered as fake orders and should not be kept in final data
- There must be duplication in final data

---
### Importing required libraries

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("dataset.csv")

In [3]:
df.head()

,item_id,order_id,product_id,amount,status,item_timestamp,location,customer_name,customer_phone,country,description
0,4dc01ae9-c1a8-461e-afa5-7e426578fd0a,160794,647,2237.23,Cancelled,2024-01-13 21:34:34.618927,East Cameron,Richard Stevens,(774)709-6342x106,Guatemala,Room as address heart vote PM.
1,cafaa69b-f0c5-42c9-8876-01b415c4497d,105101,127,2029.17,NaN,2024-04-24 03:22:23.515454,East Richardville,Keith Lamb,924-443-4084x8236,Saint Barthelemy,Nice beat despite hair face dinner miss recent...
2,77944e0c-f500-456a-9f18-32f2948e93d3,510841,243,848.88,Cancelled,2024-05-29 17:05:37.436639,South Christinaburgh,Patrick Allen,001-734-642-3018,Mauritania,Accept part crime hot leave.
3,1019711d-53c9-4015-bb0b-c3b23149dfa2,259964,209,614.64,Returned,2024-01-03 02:18:15.231398,South Jeremybury,Wendy White,+1-210-390-0363,Cameroon,Top huge old behavior western. Huge according ...
4,8e4497f4-78f2-495a-a251-fc84ee123922,270130,637,2898.00,NaN,2024-05-14 21:24:18.693104,Duncanland,Dustin Hicks,230.673.9935,Maldives,Style there TV social more body. Although onto...

### **Checking count of rows and column in df**

In [4]:
df.shape

(100000, 11)

**There are total `100000 rows` and `11 column`**

## Transformation phase

### **Checking datatype of order_id**

In [5]:
df["order_id"].dtype

dtype('int64')

**`order_id` is already in integer type**

### Checking `product ID`

In [6]:
df[df["product_id"] == 0].shape

(112, 11)

**There are total `112` rows where `product ID` is `0`, so either I can drop it from `df` or replace `0` with some other valid unique IDs**

**For this task, I am dropping rows where `product_id` is 0**

In [7]:
df = df[df["product_id"] != 0]

In [8]:
df.shape

(99888, 11)

### Checking product price

In [9]:
df[df["amount"] > 1500].shape

(69904, 11)

#### There are total `69904 rows` where amount is greater then `1500`, so replacing values of these with `1500`

In [10]:
df["amount"] = np.where(df["amount"] > 1500, 1500, df["amount"])

### Checking item's `status`

In [11]:
df["status"].isna().sum()

16487

**There are total `16487 rows` where value in status column is `Null`, so dropping them from original data**

In [12]:
df.dropna(subset=['status'], inplace=True)

### Dropping duplicates if exist

In [13]:
df.drop_duplicates(inplace=True)

### Checking Shape of final data

In [14]:
df.shape

(83401, 11)

---

### Saving data into `CSV file`, will load that data into DB in `table_to_db.py` file

In [ ]:
df.to_csv("transformed_data.csv", index=False)